package com.edu.nju.asi.utilities.enums;

/**
 * Created by cuihua on 2017/6/8.
 * <p>
 * 股票的行业信息
 */
public enum IndustryType {

    all(0),
    金融行业(1),
    房地产(2),
    综合行业(3),
    建筑建材(4),
    玻璃行业(5),
    家电行业(6),
    纺织行业(7),
    食品行业(8),
    电子信息(9),
    交通运输(10),
    汽车制造(11),
    商业百货(12),
    电力行业(13),
    酒店旅游(14),
    机械行业(15),
    农林牧渔(16),
    电器行业(17),
    电子器件(18),
    石油行业(19),
    有色金属(20),
    生物制药(21),
    医疗器械(22),
    物资外贸(23),
    传媒娱乐(24),
    发电设备(25),
    水泥行业(26),
    塑料制品(27),
    钢铁行业(28),
    化纤行业(29),
    农药化肥(30),
    公路桥梁(31),
    造纸行业(32),
    化工行业(33),
    环保行业(34),
    煤炭行业(35),
    酿酒行业(36),
    供水供气(37),
    开发区(38),
    印刷包装(39),
    纺织机械(40),
    仪器仪表(41),
    飞机制造(42),
    其它行业(43),
    家具行业(44),
    摩托车(45),
    服装鞋类(46),
    陶瓷行业(47),
    船舶制造(48),
    次新股(49),
    none(50);

    int repre;

    IndustryType(int repre) {
        this.repre = repre;
    }
}
